#include <Windows.h>
#include <tracy/Tracy.hpp>

#include <D2Client.h>
// D2Game
#include <GAME/Game.h>
#include <GAME/Clients.h>
 // D2Client
#include <CGAME/Msg.h>
#include <CGAME/Game.h>
#include <CGAME/Record.h>
#include <CGAME/View.h>
#include <D2CommonDefinitions.h>
#include <D2Gfx.h>
#include <Window.h>
#include <D2Net.h>
#include <D2Dungeon.h>
#include <D2Environment.h>
#include <Drlg/D2DrlgDrlg.h>
#include <Drlg/D2DrlgActivate.h>
#include <UI/UI.h>
#include <Sound/Sound.h>
#include <Client.h>
#include <D2WinPalette.h>
#include <D2WinMain.h>
#include <D2WinFont.h>
#include <DataTbls/LevelsTbls.h>
#include <D2Sound.h>
#include <BnClient.h>
#include <Engine/Cursor.h>
#include <Core/WNDPROC.h>
#include <D2StrTable.h>
#include <UI/CmdTbl.h>
#include <D2CMP.h>
#include <Core/WINMAIN.h>
#include <DataTbls/StringIds.h>
#include <Server.h>

#ifdef D2_VERSION_110F

static const int D2MCPClientImageBase = 0x6F9F0000;

HMODULE delayedD2CLIENTDllBaseGet()
{
    static HMODULE DLLBASE_D2LANG = LoadLibraryA("D2Client.dll");
    return DLLBASE_D2LANG;
}
HMODULE delayedD2MCPClientDllBaseGet()
{
    static HMODULE DLLBASE_D2LANG = LoadLibraryA("D2MCPClient.dll");
    return DLLBASE_D2LANG;
}

HMODULE delayedD2SoundDllBaseGet()
{
    static HMODULE DLLBASE_D2LANG = LoadLibraryA("D2Sound.dll");
    return DLLBASE_D2LANG;
}

D2FUNC(D2MCPClient, 10003, void, , (), 0x6F9F1A20 - D2MCPClientImageBase);
D2FUNC(D2Sound, 10032, BOOL, , (), 0x6F984A00 - D2SoundImageBase);

D2CLIENTSTUB(ENV_Shutdown, 6FAA6AB0, void, __fastcall, ());
D2VAR(D2CLIENT, psgpGlobalSeed, D2SeedStrc*, 0x6FBA7988 - D2ClientImageBase);
D2VAR(D2CLIENT, pgbDataLocalColorUseGreenBlood, BOOL, 0x6FBA794C - D2ClientImageBase);

D2CLIENTSTUB(D2Client_ShutdownSound, 6FB54860, void, __fastcall, ());
D2CLIENTSTUB(CLIENT_SetPlayerUnit, 6FB28390, void, __fastcall, (D2UnitStrc* pPlayerUnit));
D2CLIENTSTUB(D2CLIENT_OpenFile, 6FB6B91C, BOOL, __fastcall, (int a1, const char* pzFileName, HANDLE* pOutHandle, int a4));
D2CLIENTSTUB(UI_LoadingScreenInit, 6FB241A0, void, __fastcall, ());
D2CLIENTSTUB(UI_UpdateLoadingScreen, 6FB242E0, void, __fastcall, (BOOL bIncrementLoadingScreenFrame));
D2CLIENTSTUB(sub, 6FB6BB88, void*, __fastcall, (void*));
D2CLIENTSTUB(sub, 6FAA9420, void, __fastcall, ());
D2CLIENTSTUB(D2Client_PalshiftInit, 6FAADEA0, void, __fastcall, ());
D2CLIENTSTUB(D2Client_InitAllCaches, 6FAA13A0, void, __fastcall, (void* pMemPoolSystem, int bInitTileCache));
D2CLIENTSTUB(sub, 6FB3F330, void, __fastcall, ());
D2CLIENTSTUB(sub, 6FABA580, void, __fastcall, ());
D2CLIENTSTUB(sub, 6FB28020, void, __fastcall, ());
D2CLIENTSTUB(sub, 6FAA46A0, void, __fastcall, ());
D2CLIENTSTUB(InitEnvironment, 6FAA6A10, void, __fastcall, ());
D2CLIENTSTUB(sub, 6FAD2F60, void, __fastcall, ());


//1.10f: D2Client.0x6FB758E0
uint32_t /*D2C_StringIndices*/ aErrorStrIndices[] = {
	STR_IDX_5365_Unable_to_enter_game_Bad_character_versi,
	STR_IDX_5366_Unable_to_enter_game_Bad_character_quest,
	STR_IDX_5367_Unable_to_enter_game_Bad_character_waypo,
	STR_IDX_5368_Unable_to_enter_game_Bad_character_stats,
	STR_IDX_5369_Unable_to_enter_game_Bad_character_skill,
	STR_IDX_5371_Unable_to_enter_game,
	STR_IDX_5370_failed_to_join_game,
	STR_IDX_5357_Your_connection_has_been_interrupted,
	STR_IDX_5358_The_Host_of_this_game_has_left,
	STR_IDX_5372_unknown_failure,
	STR_IDX_5373_Unable_to_enter_game_Bad_inventory_data,
	STR_IDX_5374_Unable_to_enter_game_bad_dead_bodies,
	STR_IDX_5375_Unable_to_enter_game_bad_header,
	STR_IDX_5376_Unable_to_enter_game_bad_hireables,
	STR_IDX_5377_Unable_to_enter_game_bad_intro_data,
	STR_IDX_5378_Unable_to_enter_game_bad_item,
	STR_IDX_5379_Unable_to_enter_game_bad_dead_body_item,
	STR_IDX_5380_Unable_to_enter_game_generic_bad_file,
	STR_IDX_5381_Game_is_full,
	STR_IDX_5360_Versions_do_not_match_Please_log_onto_ba,
	STR_IDX_5364_Unable_to_enter_game_Your_character_must,
	STR_IDX_5363_Unable_to_enter_game_Your_character_must,
	STR_IDX_5362_Unable_to_enter_game_A_normal_character_,
	STR_IDX_5361_Unable_to_enter_game_A_hardcore_characte,
	STR_IDX_5359_A_dead_hardcore_character_cannot_join_or,
	STR_IDX_10101_x_NORMAL_CANT_JOIN_EXP_GAME,
	STR_IDX_10102_x_EXP_CANT_JOIN_NORMAL_GAME,
	STR_IDX_5370_failed_to_join_game,
	STR_IDX_5371_Unable_to_enter_game,
};
#ifdef D2_VERSION_110F
static_assert(D2JOINERR_COUNT == 29 && ARRAY_SIZE(aErrorStrIndices) == D2JOINERR_COUNT, "There are 29 error types in the original game");
#endif//D2_VERSION_110F
//1.10f: D2Client.0x6FBA77EC
D2C_JoinErrors gdwErrorMessageIndex;

#pragma pack(push, 1)
struct ClientGlobalData								//Size:0x80
{
	int field_0;									//0x00
	void(__fastcall* pfDraw)(DWORD);				//0x04
	void* pMemPoolSystem;							//0x08
	int gnFrameStartTickCount_6FBA775C;				//0x0C
	int gnPreviousFrameStartTickCount_6FBA7760;		//0x10
	int field_14;									//0x14
	DWORD gnFramesElapsed_6FBA7768;					//0x18
	int nNextNetUpdateTickCount_6FBA776C;			//0x1C
	int gnLastNetUpdateBeginTickCount_6FBA7770;		//0x20
	int gnPing_6FBA7774;							//0x24
	int gnFPSRendered_6FBA7778;						//0x28
	int gnRenderedFramesSinceLastCheck_6FBA777C;	//0x2C
	int gnFpsSkipped_6FBA7780;						//0x30
	int gnFramesSkippedSinceLastCheck_6FBA7784;		//0x34
	int nUnkFameStartTickCount;						//0x38
	int field_3C;									//0x3C
	BYTE gap40[4];									//0x40
	int field_44;									//0x44
	int field_48;									//0x48
	int field_4C;									//0x4C
	int field_50;									//0x50
	BYTE gap54[16];									//0x54
	int field_64;									//0x64
	BYTE gap68[12];									//0x68
	int gnExpansionFlag_6FBA77C4;					//0x74
	int gnLadderFlag_6FBA77C8;						//0x78
	int field_7C;									//0x7C
};
#ifdef D2_VERSION_110F
static_assert(sizeof(ClientGlobalData) == 0x80, "ClientGlobalData must be of size 0x80");
#endif
#pragma pack(pop)
D2VAR(D2CLIENT, psgtGlobalData, ClientGlobalData, 0x6FBA7750 - D2ClientImageBase);


//1.00 : D2Client.0x10001CA3
//1.10f: D2Client.0x6FB283D0
D2UnitStrc* __fastcall D2CLIENT_GetPlayerUnit_6FB283D0()
{
    return *D2CLIENT_pgpPlayerUnit_6FBBC200;
}
//1.00 : D2Client.0x10002F13
//1.10f: D2Client.0x6FB29370
D2ActiveRoomStrc* __fastcall D2CLIENT_GetCurrentRoom_6FB29370()
{
    if (D2CLIENT_GetPlayerUnit_6FB283D0())
    {
        return UNITS_GetRoom(D2CLIENT_GetPlayerUnit_6FB283D0());
    }
    return nullptr;
}

//1.10f: D2Client.0x6FB09C90
void __fastcall D2CLIENT_InitResolution()
{
	BOOL b800x600 = FALSE;
	SRegLoadValue("Diablo II", "Resolution", 0, (DWORD*)&b800x600);
	D2CLIENT_UI_ChangeResolution(b800x600 ? D2GAMERES_800x600 : D2GAMERES_640x480);
}

int __fastcall sub_6FAADC90()
{
	return *D2CLIENT_pdword_6FBA7BFC;
