#include "Drlg/D2DrlgOutPlace.h"

#include "D2DataTbls.h"
#include "Drlg/D2DrlgDrlg.h"
#include "Drlg/D2DrlgDrlgAnim.h"
#include "Drlg/D2DrlgDrlgGrid.h"
#include "Drlg/D2DrlgDrlgRoom.h"
#include "Drlg/D2DrlgDrlgVer.h"
#include "Drlg/D2DrlgDrlgWarp.h"
#include "Drlg/D2DrlgMaze.h"
#include "Drlg/D2DrlgOutdoors.h"
#include "Drlg/D2DrlgOutJung.h"
#include "Drlg/D2DrlgOutRoom.h"
#include "Drlg/D2DrlgOutSiege.h"
#include "Drlg/D2DrlgRoomTile.h"
#include "Drlg/D2DrlgTileSub.h"
#include "Drlg/D2DrlgPreset.h"
#include "Path/PathMisc.h"
#include "D2Seed.h"
#include <assert.h>
#include <DataTbls/LevelsIds.h>

#include <cmath>
#include <algorithm>

int dword_6FDEA6FC;

//D2Common.0x6FDCFE40
static D2DrlgLinkStrc gAct1WildernessDrlgLink[15] =
{
	{ sub_6FD81330, LEVEL_STONYFIELD, -1, -1 },
	{ sub_6FD81380, LEVEL_COLDPLAINS, 0, -1 },
	{ sub_6FD81950, LEVEL_BLOODMOOR, 1, -1 },
	{ sub_6FD81720, LEVEL_ROGUEENCAMPMENT, 2, -1 },
	{ sub_6FD81380, LEVEL_BURIALGROUNDS, 1, -1 },
	{ NULL, 0, -1, -1 },
};

//D2Common.0x6FDCFF30
static D2DrlgLinkStrc gAct1MonasteryDrlgLink[15] =
{
	{ sub_6FD81330, LEVEL_MOOMOOFARM, -1, -1 },
	{ sub_6FD81330, LEVEL_MONASTERYGATE, -1, -1 },
	{ sub_6FD81AD0, LEVEL_TAMOEHIGHLAND, 1, -1 },
	{ sub_6FD81380, LEVEL_BLACKMARSH, 2, -1 },
	{ sub_6FD81380, LEVEL_DARKWOOD, 3, -1 },
	{ NULL, 0, -1, -1 },
};

//D2Common.0x6FDD0020
static D2DrlgLinkStrc gAct2OutdoorDrlgLink[15] =
{
	{ sub_6FD81330, LEVEL_LUTGHOLEIN, -1, -1 },
	{ sub_6FD81B30, LEVEL_ROCKYWASTE, 0, -1 },

	case LEVEL_LOWERKURAST:
		DRLGOUTDOORS_SpawnOutdoorLevelPreset(pLevel, LVLPREST_ACT3_BURBS_WAYPOINT, 0, 0, 15);
		DRLGOUTJUNG_SpawnRandomPreset(pLevel, LVLPREST_ACT3_SLUMS_16X16, LVLPREST_ACT3_SLUMS_16X16, 4);
		DRLGOUTJUNG_SpawnRandomPreset(pLevel, LVLPREST_ACT3_SLUMS_08X16, LVLPREST_ACT3_SLUMS_16X08, 0);
		DRLGOUTJUNG_SpawnRandomPreset(pLevel, LVLPREST_ACT3_SLUMS_08X08, LVLPREST_ACT3_SLUMS_08X08, 0);
		break;

	case LEVEL_KURASTBAZAAR:
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, 3, 3, LVLPREST_ACT3_BURBS_SEWER, 0, 0);
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, pLevel->nWidth / 8 - 4, 3, LVLPREST_ACT3_BURBS_SEWER, 1, 0);
		DRLGOUTDOORS_SpawnOutdoorLevelPreset(pLevel, LVLPREST_ACT3_BURBS_TEMPLE, 0, 0, 15);
		DRLGOUTDOORS_SpawnOutdoorLevelPreset(pLevel, LVLPREST_ACT3_BURBS_TEMPLE, 1, 0, 15);
		DRLGOUTDOORS_SpawnOutdoorLevelPreset(pLevel, LVLPREST_ACT3_BURBS_WAYPOINT, 0, 0, 15);
		DRLGOUTJUNG_SpawnRandomPreset(pLevel, LVLPREST_ACT3_BURBS_16X16, LVLPREST_ACT3_BURBS_16X16, 4);
		DRLGOUTJUNG_SpawnRandomPreset(pLevel, LVLPREST_ACT3_BURBS_08X16, LVLPREST_ACT3_BURBS_16X08, 0);
		DRLGOUTJUNG_SpawnRandomPreset(pLevel, LVLPREST_ACT3_BURBS_08X08, LVLPREST_ACT3_BURBS_08X08, 0);
		break;

	case LEVEL_UPPERKURAST:
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, 3, pLevel->nHeight / 8 - 4, LVLPREST_ACT3_METRO_SEWER, 0, 0);
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, pLevel->nWidth / 8 - 4, pLevel->nHeight / 8 - 4, LVLPREST_ACT3_METRO_SEWER, 1, 0);
		DRLGOUTDOORS_SpawnOutdoorLevelPreset(pLevel, LVLPREST_ACT3_METROTEMPLE, 0, 0, 15);
		DRLGOUTDOORS_SpawnOutdoorLevelPreset(pLevel, LVLPREST_ACT3_METROTEMPLE, 1, 0, 15);
		DRLGOUTDOORS_SpawnOutdoorLevelPreset(pLevel, LVLPREST_ACT3_BURBS_WAYPOINT, 0, 0, 15);
		DRLGOUTJUNG_SpawnRandomPreset(pLevel, LVLPREST_ACT3_METRO_16X16, LVLPREST_ACT3_METRO_16X16, 4);
		DRLGOUTJUNG_SpawnRandomPreset(pLevel, LVLPREST_ACT3_METRO_08X16, LVLPREST_ACT3_METRO_16X08, 0);
		DRLGOUTJUNG_SpawnRandomPreset(pLevel, LVLPREST_ACT3_METRO_08X08, LVLPREST_ACT3_METRO_08X08, 0);
		break;

	case LEVEL_KURASTCAUSEWAY:
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, 0, 0, LVLPREST_ACT3_BRIDGE, 0, 0);
		break;

	default:
		return;
	}
}

//D2Common.0x6FD806A0
void __fastcall DRLGOUTPLACE_InitAct3OutdoorLevel(D2DrlgLevelStrc* pLevel)
{
	DRLGOUTPLACE_SetOutGridLinkFlags(pLevel);
	DRLGOUTJUNG_BuildJungle(pLevel);
	DRLGOUTPLACE_BuildKurast(pLevel);

	if (pLevel->nLevelId == LEVEL_TRAVINCAL)
	{
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, 0, 0, LVLPREST_ACT3_TRAVINCAL_NW, -1, 0);
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, 2, 0, LVLPREST_ACT3_TRAVINCAL_N, -1, 0);
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, 6, 0, LVLPREST_ACT3_TRAVINCAL_NE, -1, 0);
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, 0, 4, LVLPREST_ACT3_TRAVINCAL_SW, -1, 0);
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, 2, 4, LVLPREST_ACT3_TRAVINCAL_S, -1, 0);
		DRLGOUTDOORS_SpawnOutdoorLevelPresetEx(pLevel, 6, 4, LVLPREST_ACT3_TRAVINCAL_SE, -1, 0);
	}
}

#pragma pack(1)
struct D2UnkOutPlaceStrc12
{
	int field_0;						//0x00
	int field_4;						//0x04
	int field_8;						//0x08
	int nX;								//0x0C
	int nY;								//0x10
	int field_14;						//0x14
	uint8_t* field_18;					//0x18
	uint8_t nIndex;						//0x1C
	uint8_t field_1D;					//0x1D
	uint8_t field_1E;					//0x1E
	uint8_t field_1F;					//0x1F
	D2UnkOutPlaceStrc12* pNext;			//0x20
	D2UnkOutPlaceStrc12* field_24;		//0x24
};
#pragma pack()

uint8_t byte_6FDCFB70[8] = { 0, 1, 2, 3, 0, 1, 1, 1 };

char byte_6FDCFB80[] = { 1, 0, -1, 0 };
char byte_6FDCFB84[] = { 0, 1, 0, -1 };

//D2Common.0x6FD80750) --------------------------------------------------------
//TODO: Finish
BOOL __fastcall sub_6FD80750(D2DrlgLevelStrc* pLevel, int nVertexId)
{
	int v18; // eax@7
	D2UnkOutPlaceStrc12 *v21; // esi@15
	int v23; // eax@18
	int v24; // ebp@18
	int v25; // ebx@18
	D2UnkOutPlaceStrc12 *v28; // eax@22
	signed int v29; // eax@27
	int v30; // edx@29
	int v31; // eax@29
	int v32; // ecx@31
	int v33; // edi@33
	int v34; // eax@36
	int v35; // ecx@36
	int v36; // eax@37
	char v37; // bl@38
	uint8_t *v38; // ecx@38
	int v39; // eax@39
	char v40; // bl@41
	uint8_t *v41; // ebp@41
	int v42; // eax@41
	D2UnkOutPlaceStrc12 *v50; // edi@51
	void *v51; // edi@52
	D2UnkOutPlaceStrc12 *v52; // ST3C_4@52
	int v53; // eax@55
	uint8_t *v54; // ecx@55
	int v55; // ecx@57
